app/views/sessions/_session.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	<% else %>
		<%= link_to User.find(current_user).login, user_path(User.find(current_user.id).login) %>