app/views/streams/_tabsofstreams.html.erb

<script>
$(function() {
<% Stream.all.each do |stream| %>
  $("#<%= stream.source %>-tab").click(function(){
    $("#video-player").html("<div class='video-player'><iframe  src='<%= stream.streamuri %>' frameborder='0' allowfullscreen></iframe></div>")
    $document.getElementById(/([A-z])\w+-/+"tab").className="";
    $document.getElementById("<%= stream.source %>-tab").className="Active";
    return false;
  });
<% end %>
});
---
SELECT "streams".* FROM "streams" WHERE "streams"."source" = 'mlg.tv' LIMIT 1