app/views/posts/_recentposts.html.erb

      <td><%= link_to 'Show', post %></td>
      <% if current_user?(User.find_by_id(post.user_id)) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1