app/views/posts/index.html.erb

      <td><%= post.text %></td>
      <td><%= User.find_by_id(post.user_id).login %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1