app/controllers/posts_controller.rb

	def create
		@post = Post.new(params[:post].permit(:title, :text, :remote_url))
  		@post.user = current_user
		if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 07 Mar 2015 18:23:14 UTC +00:00], ["text", "posting a test"], ["title", "testing"], ["updated_at", Sat, 07 Mar 2015 18:23:14 UTC +00:00], ["user_id", 1]]

	def show
		if Post.find_by_id(params[:id]).nil?
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1

	def index
		User.all.each do |user|
			if user.privacy.nil?
				#@posts += Posts.find_by_id(user)
			end
		end
		@posts = Post.all
---
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts"