app/controllers/streams_controller.rb

	def create
	    @stream = Stream.new(params[:stream].permit(:source, :streamuri, :stream_api_url, :toggle_live, :text_to_scrape))
	    @stream.save
---
INSERT INTO "streams" ("created_at", "source", "streamuri", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 07 Mar 2015 22:16:31 UTC +00:00], ["source", ""], ["streamuri", ""], ["updated_at", Sat, 07 Mar 2015 22:16:31 UTC +00:00]]

	def show
		#check mlg
		@stream_test = Stream.find(params[:id]).streamuri
		@href = Stream.checkOnline(Stream.last)
---
SELECT "streams".* FROM "streams" WHERE "streams"."id" = 0 LIMIT 1
SELECT "streams".* FROM "streams" ORDER BY "streams"."id" DESC LIMIT 1

	def index
		Stream.all.each do |stream|
---
SELECT "streams".* FROM "streams"