app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user].permit(:login, :password, :password_confirmation, :email))
    if request.post?
      if @user.save
        flash[:message] = "Signup successful"
        session[:user_id] = @user.id
        redirect_to user_path(User.find_by_id(current_user).login)
---
INSERT INTO "users" ("created_at", "email", "hashed_password", "login", "salt") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 07 Mar 2015 18:23:06 UTC +00:00], ["email", "poop@slk.cm"], ["hashed_password", "287112a396088f332ae4725cf40a3493d5bf5e99"], ["login", "SchAmToo"], ["salt", "71LsAiNX55"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def show
      if User.find_by_login(params[:login]).nil?
---
SELECT "users".* FROM "users" WHERE "users"."login" = 'SchAmToo' LIMIT 1