app/controllers/welcome_controller.rb

  	def index
  		@posts = Post.find(:all, :order => "id desc", :limit => 5)
  		@stream = Stream.last
---
SELECT "streams".* FROM "streams" ORDER BY "streams"."id" DESC LIMIT 1

  	def frontpage
  		@posts = Post.find(:all, :order => "id desc", :limit => 5)
  		@stream = Stream.last
---
SELECT "streams".* FROM "streams" ORDER BY "streams"."id" DESC LIMIT 1

  	def show
  	  	@posts = Post.find(:all, :order => "id desc", :limit => 5)
  		@stream = Stream.last
---
SELECT "streams".* FROM "streams" ORDER BY "streams"."id" DESC LIMIT 1